api/controllers/CleaningController.php

SELECT COUNT(*) FROM `cleaning`
SELECT `id`, `type`, `price` FROM `cleaning` LIMIT 20
SELECT * FROM `cleaning_image` WHERE `cleaning_id`=1
---
    public function actionIndex()
    {
        if (Yii::$app->request->isPost) {
            $model = new CleaningOrder;
            $model->cleaning_id = Yii::$app->request->post('cleaning_id');
            $model->name = Yii::$app->request->post('name');
            $model->address = Yii::$app->request->post('address');
            $model->phone_number = Yii::$app->request->post('phone_number');
            $model->note = Yii::$app->request->post('note');
            $model->start_at = Yii::$app->request->post('start_at');
            $model->customer_profile_id = Yii::$app->request->post('customer_profile_id');

            return $model->apiOrder($model);
        }

        $dataProvider = new ActiveDataProvider([
            'query' => Cleaning::find()->select(['id', 'type', 'price']),
            'pagination' => [
                'pageSize' => 20,
            ],
        ]);

        foreach( $dataProvider->models as $model){
            $images = \frontend\models\CleaningImage::find()->where(['cleaning_id' => $model->id])->all();