api/controllers/FoodController.php

SELECT COUNT(*) FROM `food`
SELECT `id`, `name`, `price` FROM `food` LIMIT 20
SELECT * FROM `food_image` WHERE `food_id`=1
---
    public function actionIndex()
    {
        if (Yii::$app->request->isPost) {
            $model = new FoodOrder;
            $model->food_id = Yii::$app->request->post('food_id');
            $model->total_calculation = Yii::$app->request->post('total_calculation');
            $model->name = Yii::$app->request->post('name');
            $model->delivery_address = Yii::$app->request->post('delivery_address');
            $model->phone_number = Yii::$app->request->post('phone_number');
            $model->customer_profile_id = Yii::$app->request->post('customer_profile_id');

            return $model->apiOrder($model);
        }

        $dataProvider = new ActiveDataProvider([
            'query' => Food::find()->select(['id', 'name', 'price']),
            'pagination' => [
                'pageSize' => 20,
            ],
        ]);

        foreach( $dataProvider->models as $model){
            $images = \frontend\models\FoodImage::find()->where(['food_id' => $model->id])->all();