api/controllers/HotelController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => Hotel::find()->select(['id', 'name', 'address', 'hotel_room_type_id']),
            'pagination' => [
                'pageSize' => 20,
            ],
        ]);

        foreach( $dataProvider->models as $model){
            $images = \frontend\models\HotelImage::find()->where(['hotel_id' => $model->id])->all();
---
SELECT COUNT(*) FROM `hotel`
SELECT `id`, `name`, `address`, `hotel_room_type_id` FROM `hotel` LIMIT 2 OFFSET 8
SELECT * FROM `hotel_image` WHERE `hotel_id`=3