api/controllers/MassageController.php

SELECT COUNT(*) FROM `massage`
SELECT `id`, `name`, `price`, `description` FROM `massage` LIMIT 20
SELECT * FROM `massage_image` WHERE `massage_id`=1
---
    public function actionIndex()
    {
        if (Yii::$app->request->isPost) {
            $model = new MassageOrder;
            $model->massage_id = Yii::$app->request->post('massage_id');
            $model->name = Yii::$app->request->post('name');
            $model->address = Yii::$app->request->post('address');
            $model->phone_number = Yii::$app->request->post('phone_number');
            $model->email = Yii::$app->request->post('email');
            $model->start_at = Yii::$app->request->post('start_at');
            $model->customer_profile_id = Yii::$app->request->post('customer_profile_id');

            return $model->apiOrder($model);
        }

        $dataProvider = new ActiveDataProvider([
            'query' => Massage::find()->select(['id', 'name', 'price', 'description']),
            'pagination' => [
                'pageSize' => 20,
            ],
        ]);

        foreach( $dataProvider->models as $model){
            $images = \frontend\models\MassageImage::find()->where(['massage_id' => $model->id])->all();