api/controllers/TowingController.php

    public function actionIndex()
    {
        if (Yii::$app->request->isPost) {
            $model = new TowingOrder;
            $model->towing_id = Yii::$app->request->post('towing_id');
            $model->name = Yii::$app->request->post('name');
            $model->phone_number = Yii::$app->request->post('phone_number');
            $model->pickup = Yii::$app->request->post('pickup');
            $model->destination = Yii::$app->request->post('destination');
            $model->note = Yii::$app->request->post('note');
            $model->start_at = Yii::$app->request->post('start_at');
            $model->customer_profile_id = Yii::$app->request->post('customer_profile_id');

            return $model->apiOrder($model);
        }

        $dataProvider = new ActiveDataProvider([
            'query' => Towing::find()->select(['id', 'list_vehicle_type_id', 'price']),
            'pagination' => [
                'pageSize' => 20,
            ],
        ]);
---
SELECT COUNT(*) FROM `towing`
SELECT `id`, `list_vehicle_type_id`, `price` FROM `towing` LIMIT 20