frontend/models/Payment.php

        }
        $payment->list_type_order_id = $type_order;
        $payment->order_id = $order->id;
        $payment->save();
---
INSERT INTO `payment` (`payment_code`, `date_due`, `total_price`, `amount_due`, `list_type_order_id`, `order_id`) VALUES ('yBNRqUHKq-1572331641', NULL, 15000, 15000, 5, 17)